[{"model": "blogger.recipe", "pk": 1, "fields": {"title": "Never Fail Pie Crust", "image": 2, "text": "<p style=\"text-align: justify; \">For a one crust pie like the pumpkin pie that I made last night pictured below-actually I have been eating my Thanksgiving dinner piece by piece making items for my food photo shoot for this update-of course it is. I did get a little carried away and cut leaf designs with a cookie cutter to decorate the pie. Follow the directions on the Libby’s can for the pumpkin pie.&nbsp; For a one-crust pie that is baked without a filling you have to weigh it down.&nbsp; This can be accomplished by lining the shell with foil and placing some dry beans on top or by purchasing clay pie weights.<br></p>", "promoted": false, "slug": "never-fail-pie-crust", "author": 1, "created_at": "2016-03-09T04:05:29.998Z"}}, {"model": "blogger.recipe", "pk": 2, "fields": {"title": "Sweet Potatoes In Orange Cups", "image": null, "text": "", "promoted": false, "slug": "sweet-potatoes-in-orange-cups", "author": 1, "created_at": "2016-03-09T07:05:09.028Z"}}, {"model": "blogger.ingredient", "pk": 1, "fields": {"quantity": "1 1/2", "unit": "cups", "name": "flour", "recipe": 1}}, {"model": "blogger.ingredient", "pk": 2, "fields": {"quantity": "1", "unit": "tsp", "name": "slt", "recipe": 1}}, {"model": "blogger.ingredient", "pk": 3, "fields": {"quantity": "1 1/2", "unit": "tsp", "name": "sugar", "recipe": 1}}, {"model": "blogger.ingredient", "pk": 4, "fields": {"quantity": "1/2", "unit": "cup", "name": "canola oil", "recipe": 1}}, {"model": "blogger.ingredient", "pk": 5, "fields": {"quantity": "2", "unit": "tbsp", "name": "milk", "recipe": 1}}, {"model": "blogger.ingredient", "pk": 6, "fields": {"quantity": "3", "unit": "", "name": "large oranges", "recipe": 2}}, {"model": "blogger.ingredient", "pk": 7, "fields": {"quantity": "2", "unit": "lbs", "name": "sweet potatoes", "recipe": 2}}, {"model": "blogger.ingredient", "pk": 8, "fields": {"quantity": "1/3", "unit": "cup", "name": "light brown sugar", "recipe": 2}}, {"model": "blogger.ingredient", "pk": 9, "fields": {"quantity": "1/4", "unit": "cup", "name": "margarine", "recipe": 2}}, {"model": "blogger.ingredient", "pk": 10, "fields": {"quantity": "Any", "unit": "", "name": "Coconut, pecans, etc", "recipe": 2}}, {"model": "blogger.recipestep", "pk": 1, "fields": {"name": "Stir", "text": "In a measuring cup, stir together oil and milk.  In a medium bowl stir together flour, salt and sugar if using.  Add canola oil mixture and stir with fork until blended.", "recipe": 1}}, {"model": "blogger.recipestep", "pk": 2, "fields": {"name": "Roll", "text": "With hand roll into a ball, separate and flatten into rounds.  Roll between wax paper into a 12-inch circle.  Peel off top paper and turn into pie plate and fit loosely.", "recipe": 1}}, {"model": "blogger.recipestep", "pk": 3, "fields": {"name": "Bake", "text": "Bake at 450 degrees F. or until golden brown.", "recipe": 1}}, {"model": "blogger.recipestep", "pk": 4, "fields": {"name": "Cut", "text": "Cut oranges in half and squeeze out juice reserving ½ cup of juice.  Carefully remove pulp from shell-I use a grapefruit knife.  You can cut a scallop design on the edge with kitchen shears", "recipe": 2}}, {"model": "blogger.recipestep", "pk": 5, "fields": {"name": "Cook", "text": "Cook potatoes in the microwave following manufactures directions. When cool enough to handle, scoop out inside of potato into a medium bowl.  Mash and beat with a wooden spoon until smooth", "recipe": 2}}, {"model": "blogger.recipestep", "pk": 6, "fields": {"name": "Add", "text": "add orange juice, brown sugar and three tablespoons of butter or Smart Balance Margarine.  Spoon mixture in shells and swirl with a knife", "recipe": 2}}, {"model": "blogger.recipestep", "pk": 7, "fields": {"name": "Brush", "text": "Brush edges with and remaining butter or Smart Balance.  As an added treat you can decorate the tops with pecans or your choice of nuts or coconut.", "recipe": 2}}, {"model": "blogger.recipestep", "pk": 8, "fields": {"name": "Refridgerate", "text": "Cover tightly with foil and refrigerate over night", "recipe": 2}}, {"model": "blogger.recipestep", "pk": 9, "fields": {"name": "Bake", "text": "Bake in a 350 degrees oven for approximately 30 minutes", "recipe": 2}}, {"model": "blogger.post", "pk": 1, "fields": {"header": 1, "author": 1, "title": "Happy Thanksgiving", "body": "<p align=\"center\" style=\"text-align: justify; margin-top: 4px;\">Well I am hanging by a thread here not knowing what is working and what isn’t, but I am going to wing it an at least try and hope this update reaches you.&nbsp; I just felt obligated to produce something for the holiday as I have for the last 20 years-eleven years for the paper and this will be my ninth year for my web site.</p><p style=\"text-align: justify; margin-top: 4px;\">This is going to be very brief, but I wanted to share some of my recipes from those past years, all which have been very popular and also very helpful in getting that Thanksgiving feast on the table.&nbsp; All the recipes are made the day before, refrigerated and popped in the oven on Thanksgiving Day.&nbsp; All are very easy to make and are all very delicious.&nbsp; All the recipes take approximately 45 to 30 minutes in the oven.&nbsp; After your turkey is ready, simple place all the dishes in the oven and while the turkey is resting and you make the gravy, every thing will be ready.</p><p style=\"text-align: justify; margin-top: 4px;\"><img src=\"/media/django-summernote/2016-03-09/808c549a-da10-477f-875a-2f9ff22bd153.jpg\" style=\"width: 100%;\"><br></p><p style=\"text-align: justify; margin-top: 4px;\">Also make your desserts the day before too, most of the desserts that contain pumpkin are usually chilled anyway.&nbsp; Most of you probably know how to make pumpkin pie and if not just follow that old standby Libby’s pumpkin pie recipe. I am still on that one-hour break routine because of my neck injury, so I will see you in a bit.&nbsp; I’m back, and I just removed my mini sweet potato recipe from the oven and when it cools I will photograph it for this update.&nbsp; I enjoyed the squash recipe for dinner as I prepared it yesterday and placed it in the refrigerator over night and baked it for 30 minutes.&nbsp; Yum!&nbsp; It is a good thing that the most enjoyable task for me is being in the kitchen cooking and because I didn’t have a photo-didn’t have digital at the time-and I had to eat, I made two mini recipes.&nbsp; I will be doubling the recipes for Thanksgiving. Hopefully, you will be able to try 1 or 2 of them.&nbsp; If not file them away for next year or use them for your vegetable dish during the year or at least in the winter.&nbsp; Remember that healthy hint “Eat in season” and sweet potatoes and butternut squash are root vegetables and keep in a cool environment for a very long period. In earlier times vegetables for kept in a cold cellar or pickled and would sustain people through the cold winter.&nbsp; It sure makes sense to me and as always “Mother Nature knows best.</p><p style=\"text-align: justify; margin-top: 4px;\">Well, I am not going to waste any more time chatting and get right to sharing my recipes and from all the feed back I received when I introduced them I can guarantee that you guest will enjoy them.&nbsp; Oh, I just received a call from my daughter asking me a question pertaining to the easy and never fail piecrust recipe that I shared some time ago.&nbsp; She asked if she could make it today and refrigerate it overnight-of course, but let it sit for about 10 to 15 minutes before you attempt to roll it and for you who are piecrust making challenged you can omit the roiling step and just pat it in your pie plate.</p><p style=\"text-align: justify; margin-top: 4px;\">In a measuring cup, stir together oil and milk.&nbsp; In a medium bowl stir together flour, salt and sugar if using.&nbsp; Add canola oil mixture and stir with fork until blended. With hand roll into a ball, separate and flatten into rounds.&nbsp; Roll between wax paper into a 12-inch circle.&nbsp; Peel off top paper and turn into pie plate and fit loosely.</p><p style=\"text-align: justify; margin-top: 4px;\">For a one crust pie like the pumpkin pie that I made last night pictured below-actually I have been eating my Thanksgiving dinner piece by piece making items for my food photo shoot for this update-of course it is. I did get a little carried away and cut leaf designs with a cookie cutter to decorate the pie. Follow the directions on the Libby’s can for the pumpkin pie.&nbsp; For a one-crust pie that is baked without a filling you have to weigh it down.&nbsp; This can be accomplished by lining the shell with foil and placing some dry beans on top or by purchasing clay pie weights.&nbsp; Bake at 450 degrees F. or until golden brown.&nbsp; For a double crust pie repeat directions for rolling and placing in pie plate, fill and repeat rolling and simpler place on top of filling. Cut four short slits spaced evenly on top and follow instructions in your recipe for oven temperature and baking time.</p>", "created_at": "2016-03-09T04:05:42.921Z", "publish_at": "2016-03-09T04:01:48Z", "published": true, "promoted": false, "slug": "happy-thanksgiving", "recipes": [1, 2]}}]